; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	instrument13 - instrument
	satellite7 - satellite
	instrument14 - instrument
	satellite8 - satellite
	instrument15 - instrument
	instrument16 - instrument
	instrument17 - instrument
	satellite9 - satellite
	instrument18 - instrument
	instrument19 - instrument
	instrument20 - instrument
	image0 - mode
	spectrograph1 - mode
	thermograph2 - mode
	Star0 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image0)
	(calibration_target instrument4 Star3)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument6 thermograph2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
	(supports instrument10 thermograph2)
	(supports instrument10 image0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star3)
	(supports instrument11 thermograph2)
	(calibration_target instrument11 Star0)
	(supports instrument12 spectrograph1)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 GroundStation2)
	(supports instrument13 spectrograph1)
	(supports instrument13 image0)
	(supports instrument13 thermograph2)
	(calibration_target instrument13 GroundStation4)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star0)
	(supports instrument14 image0)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 GroundStation4)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation2)
	(supports instrument15 image0)
	(supports instrument15 thermograph2)
	(calibration_target instrument15 GroundStation2)
	(supports instrument16 spectrograph1)
	(supports instrument16 image0)
	(supports instrument16 thermograph2)
	(calibration_target instrument16 Star3)
	(supports instrument17 spectrograph1)
	(supports instrument17 thermograph2)
	(supports instrument17 image0)
	(calibration_target instrument17 GroundStation2)
	(on_board instrument15 satellite8)
	(on_board instrument16 satellite8)
	(on_board instrument17 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star8)
	(supports instrument18 image0)
	(supports instrument18 thermograph2)
	(calibration_target instrument18 Star3)
	(supports instrument19 spectrograph1)
	(calibration_target instrument19 GroundStation1)
	(supports instrument20 thermograph2)
	(calibration_target instrument20 Star3)
	(on_board instrument18 satellite9)
	(on_board instrument19 satellite9)
	(on_board instrument20 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Phenomenon6)
)
(:goal (and
	(pointing satellite1 Star3)
	(pointing satellite2 GroundStation2)
	(pointing satellite3 Phenomenon7)
	(have_image Planet5 spectrograph1)
	(have_image Phenomenon6 image0)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 image0)
	(have_image Planet9 image0)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 8
2. (calibrate satellite3 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 8
3. (turn_to satellite3 planet9 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 planet9)
   goals met: 0 of 8
4. (take_image satellite3 planet9 instrument7 image0)
   added: (have_image planet9 image0)
   goals met: 1 of 8
5. (turn_to satellite3 planet5 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 planet5)
   goals met: 1 of 8
6. (take_image satellite3 planet5 instrument7 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite3 phenomenon6 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon6)
   goals met: 2 of 8
8. (turn_to satellite2 groundstation2 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 groundstation2)
   goals met: 3 of 8
9. (turn_to satellite1 star3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 star3)
   goals met: 4 of 8
10. (take_image satellite3 phenomenon6 instrument7 image0)
   added: (have_image phenomenon6 image0)
   goals met: 5 of 8
11. (turn_to satellite3 star8 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 star8)
   goals met: 5 of 8
12. (take_image satellite3 star8 instrument7 image0)
   added: (have_image star8 image0)
   goals met: 6 of 8
13. (turn_to satellite3 phenomenon7 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 phenomenon7)
   goals met: 7 of 8
14. (take_image satellite3 phenomenon7 instrument7 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 8 of 8
